module/annotservice/cloudservice/CloudServiceSoapBinding.submitMediaAnnotationTextAndTokenDigest.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:tns="http://service.annot.me/">
 <SOAP-ENV:Body>
   <tns:submitMediaAnnotationTextAndTokenDigest>
    <text></text>
    <pos>0</pos>
    <posType>0</posType>
    <tokenDigest></tokenDigest>
    <tokenSection>0</tokenSection>
   </tns:submitMediaAnnotationTextAndTokenDigest>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
